import "./TermsOfService.css";

export default function TermsOfService() {
  return (
    <div className="terms-service-container">
      <h4>스페이스 계정 이용약관</h4>
      <div className="terms-service-item">
        <strong>제1조 (목적)</strong>
        <br /> ① 스페이스 계정 서비스 이용약관은 본 약관 및 추후 추가될 수 있는
        별도의 약관들을 포함한 ‘서비스’에 대한 전체 약관을 말하며, 이하
        ‘약관’이라 합니다.
        <br />② 스페이스 계정 이용약관은 ‘회사’가 홈페이지를 통해 제공하는
        스페이스 계정 (이하, ‘서비스’라 함)를 본 약관에 따라 이용계약을 체결한
        이용자(이하, 해당 계약을 ‘이용계약’, 해당 이용자를 ‘회원’이라 함)가
        이용함에 있어 ‘회사’와 ‘회원’과의 법률관계를 명확히 함을 그 목적으로
        합니다.
        <br />③ ‘회사’는 ‘약관’ 및 개인정보처리방침을 ‘회원’이 쉽게 확인할 수
        있도록 ‘서비스’의 초기화면 등에 게시합니다.
      </div>
      <div className="terms-service-item">
        <strong>제2조 (스페이스 계정 생성 및 이용)</strong>
        <br /> ① 스페이스 계정이란 ‘회사’가 제공하는 ‘서비스’를 사용하기 위해서,
        ‘회원’이 생성한 로그인 계정을 의미합니다. 스페이스 계정은 ‘회원’이
        ‘약관’에 동의하고, 계정 정보를 입력하시면, ‘회사’가 일정 정보를
        인증(이메일 주소 확인)한 후 가입을 인증하는 절차로 생성됩니다.
        <br />② ‘회사’가 제공하는 ‘서비스’를 원활히 이용하기 위해서는 스페이스
        계정이 필요하며, 일부 메뉴 및 ‘서비스’는 ‘회원’ 가입 없이도 이용이
        가능합니다.
        <br />③ 계정을 생성한 이후에는 ‘회사’가 제공하는 스페이스 연동 서비스
        전체를 이용하실 수 있습니다. 다만, ‘회사’의 신규 서비스에 최초 로그인 시
        사용 동의 및 개별 서비스 이용약관에 대한 동의 등의 절차를 진행합니다.
      </div>
      <div className="terms-service-item">
        <strong>제3조 (이용계약의 체결)</strong>
        <br /> ① ‘이용계약’은 ‘회원’이 되고자 하는 자(이하, ‘가입신청자’라 함)가
        ‘약관’의 내용에 대하여 동의를 한 다음 회원가입신청을 하고, ‘회사’가
        이러한 신청에 대하여 승낙함으로써 체결되며, ‘가입신청자’는 ‘회사’의
        승낙에 따라 ‘이용계약’이 체결되는 시점부터 ‘회원’이 되어 ‘약관’에 따라
        ‘서비스’를 이용할 수 있습니다.
        <br />
        ② ‘회사’는 ‘이용계약’ 체결 과정에서 ‘가입신청자’의 이메일 주소 등의
        (개인)정보를 수집할 수 있으며, 이 경우 ‘가입신청자’는 정확한(거짓이
        아닌) 정보를 제공하여야 합니다. 본 항에 따른 개인정보의 수집 및 이용과
        보관 등에 대해서는 별도로 게시되는 개인정보처리방침이 적용됩니다.
        <br />③ ‘회사’는 ‘가입신청자’의 회원가입신청에 ‘서비스’ 시스템에의
        기계적 접근 또는 계정도용, 거짓된 정보의 제공 및 ‘가입신청자’의 ‘서비스’
        어뷰징 내역 확인 등의 사유가 있어 ‘회사’가 ‘가입신청자’의 신청을
        승낙하는 것이 적절하지 않은 경우 그 승낙을 유보 또는 거부하거나, 사후에
        이용계약을 해지할 수 있습니다.
        <br />
      </div>
      <div className="terms-service-item">
        <strong>제4조 (약관의 개정)</strong>
        <br /> ① ‘회사’는 관련법령에 위배되지 않는 범위에서 ‘약관’을 개정할 수
        있습니다.
        <br />② ‘회사’는 전 항에 따라 ‘약관’을 개정할 경우, 적용일자와 변경내용
        및 사유를 명시하여 ‘서비스’를 통해 사전 공지합니다. 다만, 그 변경내용이
        법적으로 ‘회원’에게 불리한 것일 경우, 그 적용일자 30일 이전부터
        변경내용을 ‘서비스’를 통해 공지할 뿐만 아니라, 해당 내용을 ‘회원’의
        이메일, 로그인 시 동의창 등의 전자적 수단을 통해 명확히 통지합니다.
        <br />③ ‘회원’은 변경되는 약관에 동의하지 않을 경우 ‘약관’을 통해
        체결되었던 ‘서비스’에 대한 이용계약을 해지하고 ‘서비스’의 이용을 중단할
        수 있습니다.
        <br />④ ‘회사’가 본 조 제2항에 따라 약관의 개정을 공지 또는 통지하면서
        적용일자 이전에 거부 의사를 표시하지 않으면 개정 약관에 동의한 것으로
        본다는 뜻을 함께 공지 또는 통지하였음에도 불구하고 ‘회원’이 명시적으로
        거절의 의사표시를 하지 않은 경우에는 ‘회원’이 개정 약관에 동의한 것으로
        봅니다.
      </div>
      <div className="terms-service-item">
        <strong>제5조 (서비스의 변경 및 중단 등)</strong>
        <br />
        ① ‘회사’는 필요한 경우 ‘서비스’의 내용을 변경할 수 있습니다. 다만,
        ‘서비스’ 내용의 변경이 ‘회원’의 권리와 의무에 중대한 영향을 미치는
        경우에는 제4조에 따른 공지 및 통지의 절차를 거쳐 변경합니다.
        <br />
        ② ‘회사’는 정보통신설비의 보수점검, 교체 및 고장, 통신두절 또는 운영상
        상당한 이유가 있는 경우 ‘서비스’의 제공을 일시적으로 중단할 수 있습니다.
        <br />
        ③ ‘회사’는 ‘서비스’의 제공에 필요한 경우 정기점검을 실시할 수 있으며,
        정기점검이 실시되는 과정에서 ‘서비스’의 제공을 일시적으로 중단할 수
        있습니다.
        <br />④ ‘회사’는 ‘회사’의 경영상의 이유 등의 사유로 ‘서비스’를 중단할 수
        있습니다.
      </div>
      <div className="terms-service-item">
        <strong>제6조 (광고의 게재)</strong>
        <br />
        ‘회사’는 ‘서비스’에 ‘회사’ 또는 제3자의 광고를 게재할 수 있습니다.
      </div>

      <div className="terms-service-item">
        <strong>제7조 (회원의 권리 및 의무)</strong>
        <br />
        ① ‘회원’은 ‘서비스’를 통해 ‘회원’에게 제공되는, 콘텐츠를 개인적,
        비영리적으로 사용하고 ‘회사’가 ‘서비스’를 통해 허용하는 행위(예를 들면
        댓글을 작성하는 행위 등)를 할 수 있습니다.
        <br />
        ② ‘회원’은 전 항의 제한된 권리 외에 ‘서비스’를 통하여 제공 받은
        ‘콘텐츠’에 대해 어떠한 권리도 취득하지 않습니다.
        <br />③ ‘회원’은 ‘콘텐츠’를 다음 각 호와 같이 본 조에 의해 허락 받은
        범위를 넘어서서 이용하는 행위를 해서는 안되며, 이와 같은 행위를 할 경우
        그에 대한 모든 민형사상 법적 책임을 집니다.
        <br />
        1. ‘콘텐츠’를 임의로 별도의 파일 등으로 재제작하는 행위 <br />
        2. ‘콘텐츠’를 임의로 인터넷에 게시하는 행위
        <br /> 3. ‘콘텐츠’를 임의로 제3자에게 제공하는 행위
        <br /> 4. 기타 ‘콘텐츠’에 대한 모든 저작권 침해 행위
        <br /> ④ ‘회원’은 ‘서비스’의 서버와 네트워크 시스템에 허락되지 않은
        방식으로 접근하는 일체의 행위 또는 ‘서비스’의 제공을 방해하는 행위를
        해서는 안됩니다.
        <br />
        ⑤ ‘회원’은 다음 각 호와 같은 행위를 해서는 안됩니다.
        <br />
        1. ‘회사’에 허위정보를 제공하거나 타인의 정보를 도용하는 행위
        <br />
        2. ‘회사’와 기타 제3자의 저작권 등 지적재산권에 대한 침해 행위
        <br />
        3. ‘회사’와 기타 제3자의 명예를 손상시키거나 업무를 방해하는 행위
        <br />
        4. ‘회사’의 동의 없이 ‘서비스’를 영리적으로 사용하는 행위
        <br />
        5. ‘서비스’와 관련하여 ‘회사’를 사칭하거나 허위 정보를 유포하는 행위
        <br />
        6. 「정보통신망 이용촉진 및 정보보호 등에 관한 법률」 등 관련법령에서
        금지하는 행위 등 기타 불법적이거나 부당한 행위
        <br />⑥ ‘회원’은 ID와 비밀번호에 대한 관리책임이 있으며, ‘회원’의 고의
        또는 과실로 일어날 수 있는 각종 손해에 대한 책임은 ‘회원’ 본인에게
        있으며, ‘회원’은 자신의 ID 및 비밀번호를 도난 당하거나 제3자가 사용하고
        있음을 인지한 경우에는 즉시 ‘회사’에 통보하고 ‘회사’의 안내가 있는
        경우에는 그에 따라야 합니다.
      </div>
      <div className="terms-service-item">
        <strong>제8조 (이용제한)</strong>
        <br />① ‘회사’는 본 조의 경우, ‘회원’의 ‘서비스’ 이용을 일시적 또는
        영구적으로 제한할 수 있습니다.
        <br /> ② 일시적 이용제한 1. ‘회원’이 제7조의 회원의 의무를 위반하는 경우
        <br /> ③ 영구적 이용제한
        <br /> 1. ‘회원’이 제7조의 회원의 의무를 상습적으로 위반하는 경우
        <br /> 2. ‘회원’의 제7조의 의무위반 행위가 범죄를 구성하는 경우
      </div>
      <div className="terms-service-item">
        <strong>제9조 (회사의 권리, 의무 및 면책)</strong>
        <br />
        ① ‘회사’는 ‘서비스’에 대한 모든 권리를 보유합니다.
        <br />
        ② ‘회사’는 ‘서비스’를 안정적으로 제공하기 위해 노력하나, 천재지변, 전쟁
        및 기타 이에 준하는 불가항력의 경우, 그리고 제5조의 경우에 ‘서비스’
        제공이 중지 또는 중단될 수 있으며, 이에 대해서 ‘회사’는 책임을 지지
        않습니다.
        <br />③ ‘회사’는 ‘회원’이 ‘콘텐츠’를 이용함으로 인해 발생하는 손해에
        대해서 ‘회사’의 고의 또는 과실 등 귀책이 없는 한 책임지지 않습니다.
      </div>
      <div className="terms-service-item">
        <strong>제10조 (통지)</strong>
        <br />
        ① ‘회사’가 ‘회원’에게 개별 통지하는 경우 ‘약관’에서 달리 정하지 않는 한
        이메일 주소로 할 수 있습니다.
        <br />② 제1항에도 불구하고 ‘회사’가 불특정 다수의 ‘회원’에게 통지하는
        경우 ‘서비스’ 화면에 7일 이상 해당 사실을 게시함으로서 개별 통지에
        갈음할 수 있습니다.
      </div>
      <div className="terms-service-item">
        <strong>제11조 (캐시)</strong>
        <br />
        ① ‘회사’는 적립금 개념의 ‘캐시’ 제도를 운영할 수 있습니다.
        <br />
        ② 캐시란 ‘회사’로부터 상품을 구매하는 등 ‘회사’가 지정한 경우에 보상받는
        점수로 상품 구매 시 결제 등 ‘회사’가 정한 경우에 사용될 수 있습니다.
        <br />
        ③ ‘회사’의 운영정책에 따라 캐시의 적립 및 사용방법이 정해집니다.
        <br />
        ④ ‘회원’이 캐시를 부당하게 적립한 경우 ‘회사’는 사전통지 없이 ‘회원’의
        캐시를 삭제할 수 있으며, ‘회원’의 ‘서비스’ 이용을 제한할 수 있습니다.
        <br />
        ⑤ ‘회원’ 자격상실 시 ‘회원’의 캐시는 소멸되며, 타인에게 양도할 수
        없습니다.
        <br />⑥ 캐시는 ‘회원’이 결제등에 사용하는 통화로 전환되어 사용될 수
        있으며, 전환비율은 ‘회사’가 정한 비율에 의합니다.
      </div>
      <div className="terms-service-item">
        <strong>제12조 (모찌)</strong>
        <br />
        ① ‘회사’는 ‘서비스’ 내에서 디지털 상품을 구매할 수 있는 전자적인
        지급수단인 모찌를 운영할 수 있습니다.
        <br />
        ② 모찌란 '회원' 이 적합한 구매수단을 활용하여 유료로 구입한 '유료
        모찌'(이하 '유료 모찌' 또는 '충전 모찌'라 함)와 '회사'가 지정한 조건을
        '회원'이 수행한 경우 또는 각종 이벤트의 보상으로 무료로 지급되는 '무료
        모찌'(이하 '무료 모찌' 또는 '적립 모찌'라 함)로 구분됩니다.
        <br />
        ③ 모찌는 '회사'가 지정한 디지털 상품의 구입에 사용될 수 있습니다.
        <br />
        ④ '무료 모찌'는 '회사'의 운영정책에 따라 적립 및 사용방법이 정해지며,
        세부적인 운영정책의 내용은 고객센터 내 FAQ에 따릅니다.
        <br />
        ⑤ ‘회원’의 디지털 상품 구입 취소 처리시 이미 사용된 ‘무료 모찌’는 즉시
        복원 처리되어 사용한 ‘무료 모찌’ 전액이 재 적립되며, 재 적립된 ‘무료
        모찌’의 유효기간은 기존 유효기간으로 원상 복구됩니다.
        <br />
        ⑥ ‘회원’이 ’무료 모찌’를 부당하게 적립한 경우 ‘회사’는 사전통지 없이
        ‘회원’의 ‘무료 모찌’를 삭제할 수 있으며, ‘회원’의 ‘서비스’ 이용을 제한할
        수 있습니다.
        <br />
        ⑦ ’무료 모찌’는 타인에게 양도할 수 없으며, ‘회원’ 자격상실 시 ‘회원’의
        ‘무료 모찌’는 소멸됩니다.
        <br />
        ⑧ ‘무료 모찌’는 ‘회원’의 ‘무료 모찌’ 획득일로부터 60개월(5년)이 지나면
        소멸됩니다. 다만, 이벤트에 의해 부여된 ‘무료 모찌’에 해당 이벤트상 개별
        유효기간이 설정되어 있는 경우, 해당 기간 만료 시에 소멸됩니다.
        <br />⑨ 이 밖에 모찌에 관하여 본 이용약관에서 규정하지 않은 사항에
        관하여는 ‘무료 모찌’에 대해서는 별도 공지된 고객센터 내 FAQ에 따르며,
        ‘유료 모찌’에 관하여는 유료서비스 이용약관에 따릅니다.
      </div>

      <div className="terms-service-item">
        <strong>제13조 (손해배상)</strong>
        <br />
        ‘회사’와 ‘회원’은 각자의 귀책에 의해 상대방에 손해를 끼친 경우, 그에
        대한 손해배상 책임을 집니다. 특히 ‘회원’이 제7조 제3항을 위반하여
        ‘콘텐츠’의 저작권을 침해한 경우, ‘회원’은 그에 대한 모든 민형사상 책임을
        부담합니다.
      </div>

      <div className="terms-service-item">
        <strong>제14조 (서비스 주체의 변경)</strong>
        <br />
        ① ‘회사’는 영업의 전부 또는 일부의 양도·합병, 인적·물적 분할, 자산
        양수도 등으로 ‘서비스’ 주체가 변경될 경우에는 정보통신망법 제26조에 따라
        개인정보의 이전을 ‘회원’에게 알리도록 합니다.
        <br />
        ② ‘회사’가 제1항에 따른 ‘서비스’ 주체가 변경될 경우 ‘약관’에 따른
        ‘회사’와 ‘회원’이 체결한 ‘이용계약’이 변경되는 ‘서비스’ 주체에게
        포괄적으로 이전됩니다.
        <br />③ ‘회사’는 ‘회원’이 개인정보의 이전과 ‘이용계약’의 이전을 원하지
        아니하는 경우 개인정보 수집 및 이용에 관한 동의와 ‘약관’ 동의를 철회할
        수 있는 방법과 절차를 안내합니다.
      </div>

      <div className="terms-service-item">
        <strong>제15조 (준거법 및 재판 관할)</strong>
        <br />
        ① 본 약관에 대해서는 대한민국법을 준거법으로 하고, 대한민국 법원이
        관할권을 갖는 것으로 합니다.
        <br />② ‘회사’와 ‘회원’ 간 발생한 분쟁에 관한 소송은 제소 당시의 회원의
        주소에 의하고, 주소가 없는 경우 거소를 관할하는 지방법원의 전속관할로
        합니다. 단, 제소 당시 회원의 주소 또는 거소가 명확하지 아니한 경우의
        관할법원은 민사소송법에 따라 정합니다. 해외에 주소나 거소가 있는 고객의
        경우 회사와 고객간 발생한 분쟁에 관한 소송은 대한민국 서울중앙지방법원을
        관할법원으로 합니다.
      </div>
    </div>
  );
}
